Documents/ВводТарифов_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВводТарифов_ат</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Тарифы_ат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоговоров_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_КомментарийВнутренний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Тарифы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТарифногоПлана</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособИзмененияЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыИзмененияЦены_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВеличинаИзмененияЦены</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокНоменклатуры</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТарифныеПланы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеВыбора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеТарифногоПлана</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Тарифы_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>Тарифы_ат</Name>
			<Comment>!!!!!HOTFIX + переименовать в ИсториюТарифов..</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоговоров_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеВыбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура_ат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВводТарифов_ат/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(Тарифы_атСрезПоследних.Период) КАК МаксимальнаяДата,
		|	НЕОПРЕДЕЛЕНО КАК Дубль
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.Тарифы_ат.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И ВидДоговора = &ВидДоговора
		|				И Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты_ат.ПустаяСсылка)) КАК Тарифы_атСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	Тарифы_атСрезПоследних.Регистратор
		|ИЗ
		|	РегистрСведений.Тарифы_ат.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидДоговора = &ВидДоговора
		|				И Клиент = &Клиент
		|				И Договор = &Договор
		|				И Проект = &Проект) КАК Тарифы_атСрезПоследних
		|ГДЕ
		|	Тарифы_атСрезПоследних.Период = &Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЕСТЬNULL(ВТ.МаксимальнаяДата, ДАТАВРЕМЯ(1, 1, 1))) КАК МаксимальнаяДата,
		|	МАКСИМУМ(ВТ.Дубль) КАК Дубль
		|ИЗ
		|	ВТ КАК ВТ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ";

	Запрос.УстановитьПараметр("Период", НачалоДействия);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Если ЗначениеЗаполнено(Выборка.Дубль) Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Существует проведённый Ввод тарифов с аналогичными ключевыми параметрами: " + Выборка.Дубль;
		Сообщение.Сообщить(); 
		
		Возврат;
		
	ИначеЕсли НачалоДействия < Выборка.МаксимальнаяДата Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Существует проведённый Ввод тарифов с датой начала действия " + Формат(Выборка.МаксимальнаяДата, "ДФ=dd.MM.yyyy");
		Сообщение.Сообщить(); 
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Тарифы_атСрезПоследних.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.Тарифы_ат.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И ВидДоговора = &ВидДоговора
		|				И НЕ Номенклатура В (&Номенклатуры)) КАК Тарифы_атСрезПоследних
		|ГДЕ
		|	НЕ Тарифы_атСрезПоследних.ОкончаниеДействия > &НачалоДействия";

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("Номенклатуры", Тарифы.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("НачалоДействия", НачалоДействия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НадоПроверитьПериод = Истина;
	
	Движения.Тарифы_ат.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		ДобавитьДвижение(Выборка.Номенклатура, 0, 0, НачалоДействия - 1);
		
	КонецЦикла;
	 
	Для Каждого Строка Из Тарифы Цикл
		
		СтрокаТарифныйПлан = ТарифныеПланы[Строка.НомерСтрокиТарифногоПлана - 1];
		
		ТарифныйПлан = ?(ПустаяСтрока(Наименование), "", Наименование + "/")
			+ ?(ПустаяСтрока(СтрокаТарифныйПлан.НазваниеТарифногоПлана), "От " + СтрокаТарифныйПлан.ЗначениеВыбора, СтрокаТарифныйПлан.НазваниеТарифногоПлана);
		
		ДобавитьДвижение(Строка.Номенклатура, СтрокаТарифныйПлан.ЗначениеВыбора, Строка.Цена, ОкончаниеДействия, ТарифныйПлан);
		
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьДвижение(Номенклатура, ЗначениеВыбора, Сумма, ДатаОкончания, ТарифныйПлан = "")
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.Тарифы_ат.Добавить();
	Движение.Период 			= НачалоДействия;
	Движение.Номенклатура 		= Номенклатура;
	Движение.ЗначениеВыбора 	= ЗначениеВыбора;
	Движение.Стоимость 			= Сумма;
	Движение.ОкончаниеДействия 	= ДатаОкончания;
	Движение.Организация 		= Организация;
	Движение.ВидДоговора 		= ВидДоговора;
	Движение.Клиент 			= Клиент;
	Движение.Договор 			= Договор;
	Движение.Проект 			= Проект;
	Движение.ТарифныйПлан 		= ТарифныйПлан;
	
КонецПроцедуры
